[
  {
    "type":"header",
    "version":"4.9.7",
    "comment":"Export to JSON plugin for PHPMyAdmin"
  },
  {
    "type":"database",
    "name":"frothmus_Froth"
  },
  {
    "type":"table",
    "name":"Albums",
    "database":"frothmus_Froth",
    "data":[
      {
        "Catalogue":"DVDCDR1",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR2",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR3",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR4",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR5",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR6",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR7",
        "DJ":"DJ Decka & DJ Vinnie",
        "Date":"",
        "Pre-comment":"In Yer Mush",
        "Post-comment":"In Yer Bush"
      },
      {
        "Catalogue":"DVDCDR8",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR9",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR10",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR11",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR12",
        "DJ":"DJ Kroll",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCDR13",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD1",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD2",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD3",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD4",
        "DJ":"DJ Decka, DJ Vinnie & DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD5",
        "DJ":"DJ Decka, DJ Vinnie & DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD6",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"<h4>\"CUE\" REVIEW<\/h4> <h2 style=\" color:#424BBD\">Pass the ultra-absorbent Bounty kitchen wipes please<\/h2> <h4>Froth - It's The Law! by DJ Dick DVD Ents Co : DVD-CD6  (72:29 mins)<\/h4> <p>This is the 18th offering in The Froth Series which started back in 1994 and my how it continues the very high standard! Anybody unfamiliar with this set of compilations has surely been living on another planet. Their aim is to blend new old and not so old tracks to stimulate the listener into such a worked-up frenzy that froth literally spumes from their every orifice and I have to admit to having several damp patches after listening to this!<\/p> <p>These recordings are famous for their cracking start and this is no exception with <em>Bohemian Like You<\/em> and <em>Learning To Fly<\/em> (the latter rumoured to have been stolen from a future Froth presentation!) literally leaving the listener out of breath! These two tracks surely capture the very essence of Froth. We get our breath back with two versions of the classic <em>Bankrobber<\/em> cleverly mixed into a single track.<\/p> <p>Pace increases again with stonking <em>Welcome to Paradise<\/em> followed by <em>You knock me off my feet<\/em> with it's excellent \\\"driving in the car on a Summer\\'s day sing-your-heart-out for the lads\\\" chorus and oh-oh ending!<\/p> <p><em>On a Rope<\/em> (recently seen on Top of the Pops 2 which had this reviewer jumping about the living room!) then follows to leave the listener knackered again! <em>Magna Cum Nada<\/em> does not relent!<\/p> <p>Stereo MC\\'s <em>Running<\/em> comes next with its thumping beat  followed by Fatboy Slim <em>Going out of my Head<\/em>. How apt is that! <em>Wierdo<\/em> keeps the tempo going whilst <em>Re-Hash<\/em> allows us to get our breath back again!<\/p> <p><em>Californication<\/em> is a total tease! It soothes and rocks and would have been this reviewers favourite track had <em>Regular John<\/em> not caused me to change my underpants! Sandwiched in between is some award-winning PJ Harvey.<\/p> <p>Time to slow down with the wonderful Turin Brakes\\' <em>Underdog<\/em> and the utterly delightful <em>In The Waiting<\/em> Line by Zero 7. Nick Cave winds-up this superb set with his <em>Red Right Hand<\/em> guaranteed to get you singing and to raise a smile.<\/p>",
        "Post-comment":"<p>Initial Limited edition copies come with a superb Bonus CD containing a mix of Classic (Paul Weller\\'s <em>Changing Man<\/em>), Heavy (<em>Ace of Spades<\/em>), Punk (<em>Teenage Kicks<\/em>) and Novelty (<em>Hawaii-5-0<\/em>). The Judge Dredd presentation is first class and the coloured CD\\'s unique.<\/p> <p>Compilations are rarely better than this! ***** Indispensable. Truly exceptional.<\/p>"
      },
      {
        "Catalogue":"DVDCD7",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD8",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD9",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD10",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD11",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD12",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD13",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD14",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD15",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD16",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD17",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD18",
        "DJ":"DJ Decka, DJ Vinnie & DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD19",
        "DJ":"DJ Bousa",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD20",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD21",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<p>Bands that have never featured on any previous Froth compilations. Working titles included Virgin Froth and Popping the Frothy Cherry. This release uses the classic Froth format (i.e. stonking start - easing up in the middle (to get your breath back) - stonking finish) and consists of mainly new bands rather than the traditional new and old mix.<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DCDCD22",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"<p>I've tried to make Froth Pipe and Slippers an honest collection of tracks; a snapshot for posterity of what I'm currently listening to as I ease out of my 30s and slide into the dotage of my 40s. Several of the tracks had been ear-marked for 'Anatomy & Frothology' however it\\'s taken so long to get even a few suitable tracks for that project that I've decided just to include them here as strategically placed musical defibrillators. The majority of tracks however are of a more mellow nature making Froth Pipe and Slippers ideal for Sunday afternoons.<\/p>",
        "Post-comment":"<p>Here are some tasting notes...<\/p>"
      },
      {
        "Catalogue":"DVDCD23",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"<p>I seemed to have struggled with this compilation more than most others for some reason. The initial idea for the project came from DJ Decka after the inclusion of the sub 2 minute \"Glass Slipper\" by Burning Brides on Sometimes...Froth Is All You Need (<a href=\"dvdcd.php?id=17\">DVDCD17<\/a>). It was suggested that a collection be put together of tracks that are no longer than 2 minutes, which seemed a great idea so the project began under the working title of \"Gone In 120 Seconds\". <\/p> <p>Isolating tracks that last less than 2 minutes was quite easy given that a copy of my entire collection now lies within the iTunes domain, however selecting an appropriate subset was another matter altogether. I initially selected 45 or so tracks that were songs in their own right (as opposed to instrumental fillers) and tried to put them into a running order but found it quite difficult. There are certain artists that have recorded quite a number of short songs worthy of inclusion into the Froth series but which didn't seem to fit with the theme of this particular one. After consulting with my fellow Froth colleagues, it was suggested that not only should the track list be of short songs, but the total playing time should be the shortest of the entire Froth collection. A limit of 20 tracks was suggested which made the final selection process a lot easier to manage.<\/p> <p>An initial track list was selected and then the tried and tested Froth profile was applied to set the running order (i.e. fast start, slow in the middle and then fast end). The main problem here was that a of short tracks seem to start quietly and build up in volume within themselves. Now although that\\'s usually a good way to up the tempo of a running order, it causes a problem when there's too many of them. The compilation then required a number of further song and artist changes but the result is quite satisfying. In fact it's so good I felt the addition of an <strong title=\"Emergency Mess Prevention\">EMP<\/strong> track was necessary!<\/p> <p>Then came the issue of the album title and I don't think I've ever been so indecisive about this. Usually, the concept and title is obvious from the incept but this time it wasn't. I didn't really like the working title (a bit clumsy) so I tried to come up with something that described the nature of this compilation. I considered words such as; spurt, squirt, burst, blast but none seemed right. I then looked upon it as a sort of whisky chaser and I thought of \"The Shooter\", \"Chaser\", etc. but that all gave the impression that it was a poor relation to something bigger (DVDCD24 perhaps?). I was reminded of a classic jazz album from 1966 by pianist Thelonious Monk called \"Straight, No Chaser\"; which I eventually settled on. I thought that would be a good title to use since it gives the impression of something bold and up-front with no messing around. <\/p> <p>Album artwork has always been very important to me and I had 2 concepts to juggle. First was a sort of an arty late night smoky jazz club, shot glass, spilt whisky concept but I couldn't find any stock artwork to back this up. Secondly was Bladerunner since there was an appropriate quote that goes; \"the light that burns twice as bright burns for half as long...and you have burned so very brightly Roy\". This was said to the replicant Roy Batty who's 4 year life was coming to an end. I thought this was particularly appropriate and for a while considered using this theme in the album title. Fortunately, I suppose, titles like \"Replicant Froth\", \"Batty-boy Froth\", \"Roy of the Frothsters\" fell by the wayside. I decided to stick with the \"Straight, No Chaser\" title, but to go for Bladerunner style imagery. Having created a master disk with all the relevant CD-Text, a voice popped into my head - Jeremy Clarkson's voice actually - saying something like \"if cars were like cups of coffee...\". It was a sort of revelation and I wondered why I hadn't thought of it before. I then sought to re-do the artwork and created another master disk with the new title. <\/p> <p>So there it is - a monumental struggle maybe, but hopefully the quality will shine through the quantity.<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD24",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<p>The original idea for this was <em>Epic Froth<\/em> where each song was a lengthy classic. However I didn't want it to be all well known songs so I changed the concept to songs over five minutes long. Just at that time the film <em>300<\/em> was released and as five minutes is 300 seconds that was the concept and artwork sorted. As usual Ive tried to create a mix of old and new fast and slow; however I've specifically tried to include a wide range of artists and styles.<\/p> <p><em>Froth 300<\/em> is the opposite time-concept to <em>Espresso Froth<\/em> (<a href=\"dvdcd23.php?id=23\">DVDCD23<\/a>) but hopefully just as frothy and enjoyable. <\/p> ",
        "Post-comment":"<p><strong>You've had it small now 'av it large!!<\/strong><\/p>"
      },
      {
        "Catalogue":"DVDCD25",
        "DJ":"DJ Decka, DJ Vinnie & DJ Dick",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD26",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"<p>First of all I would like to acknowledge the assistance of DJ Decka and DJ Bousa who provided some tracks inspiration reminders and encouragement during the protracted complilation process.<\/p> <p>The original concept for this collection was kicked around some 2 years before it came to fruition.  It is based on the premise that reggae and Bob Marley in particular has influenced many of the artists that spawned the punk movement in the mid 70s.  Marley arrived in London in 1976 after an attempt on his life and stayed to record 2 albums: Exodus and Kaya.  During this time he met other musicians including Joe Strummer.  It has been said (perhaps an urban legend) that after Marley watched The Clash perform \\\"Police and Thieves\\\" he was inspired to write Punky Reggae Party.  Fittingly the track refers to artists that all (now!) appear in one or more Froth releases of some description: The Wailers, The Dammed, The Jam, The Clash, The Maytals and Dr Feelgood too.<\/p> <p>Given the effect that reggae has had on Froth I thought it appropriate to separate tracks onto 2 CDs.  \"Inspiration\" broadly contains Jamaican artists or ideas that have inspired other artists from around the world that then appear on \"Expiration\".  This is not a strict definition of course but the tracks have been arranged to flow together rather than follow this rule to the letter.<\/p> <p>So put it on turn up the bass and chill out.<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD27",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<h4>Concept<\/h4>  <p>Two CDs one with the original song versions good enough to be a standalone Froth by itself and the other with equally good or interestingly different cover versions. Of course it's easier said than done to create a track list of songs with cover versions which have not already appeared on a previous Froth compilation so I've been slowly assembling and acquiring tracks over the last 2-3 years! For added difficulty I also tried to create this without using any of the Radio 1 Live Lounge CDs although several are taken from various other BBC sources!<\/p> <p>A future follow-up project will be cover versions of songs that have already appeared on previous Froth compilations (for which I already have quite a few contenders!).<\/p> <h4>Artwork<\/h4> <p>A mathematical and numerical theme with Einstein at its core; I thought the split Einstein CD image nicely represented the two versions of the same song concept which I inverted for disc 2. Has any of my eagle-eyed fellow Frothers noticed the subtle addition amongst the equations on the inside cover?<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD28",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD29 ",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"p>To my mind the most satisfying Froth compilation I've ever released is; Sometimes...Froth Is All You Need (<a href=\"dvdcd.php?id=17\">DVD-CD17<\/a>).  The main reason is probably that it was deliberately put together very quickly.  The tracks were chosen with a single stream of thought and even the artwork was a standard template available from Nero.  Also, I wanted to do a straight-forward Froth with no overriding theme.<\/p>\r\n<p>When contemplating this release I found myself in a similar situation; with a desire to release a non-themed Froth and to get it done quickly.  So, the tracks were collected, a put in to what I felt was a good running order.  The tracks were then pared down to 20 in order to fit on a CD; tracks by certain artists were reselected while others rejected since they interrupted the flow of the music.  This then led to the title of the album as in my mind (and probably <em>only<\/em> my mind) there is a logical link between subsequent tracks in this compilation.  The link could be rhythm, tempo, feel, style or something even more subjective.<\/p>\r\n<p>As for whether this tops my previous favourite; I invite you to listen and hope you get as much pleasure from this collection as I do.<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD30",
        "DJ":"DJ Bousa",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD31",
        "DJ":"DJ Vinnie",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD32",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<p>I had groups of songs with similar genre:<\/p> <ul> <li>Loud and Heavy<\/li> <li>Indie and Punk<\/li> <li>Acoustic and Strings<\/li> <li>Live!<\/li> <\/ul> <p>Initially I tried to build it around schizophrenia and split personalities but it was too similar to <a href=\"dvdcd.php?id=14\">Dr Jekyl & Mr Froth<\/a>. Then I thought to group them as \"Acts\" searched Shakespeare play titles and theatrical artwork <em>et voila<\/em>! The compilation has an Eels beginning middle and end (because I like them!) and for the first time ever in the whole wide world (or possibly not!) features a user-selectable reversible front cover!<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD33",
        "DJ":"DJ Dick",
        "Date":"",
        "Pre-comment":"<p>I guess there's been a great deal of inspiration behind the concept for this album but none more so than having the honour of watching Nirvana play at Bradford University in 1991.  Their performance was spellbinding and it struck me how just 3 guys could make such a blisteringly full and complete sound.  In many ways 3 is a magic number; and this compilation aims to deliver that point with all of the artists forming a 3-piece of guitar bass and drums.  I wanted to preserve a degree of purity of the collection aimed to stick with just the 3 key instruments and avoid unnecessary additions like pianos synths and the like.  They have their place of course - but not here.  I also wanted to avoid tracks where there were obvious overdubs.  Although this is really difficult to prove I think the selection here demonstrates a certain directness without the need for obvious studio trickery.<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD34",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<p>Although electronic tunes have appeared on many occasions throughout the Froth series I'm very surprised that it has taken until CD34 for its own theme! Perhaps I've just nipped in ahead of my fellow DJs? Anyway I've been compiling the list of potential songs over many years and I think it's evolved into a very frothy compilation!<\/p> <p>Although all songs are electro-based there's a surprising amount of variation. It's an interesting mix covering old and new fast and slow and including several classic and a few less well-known tunes.<\/p> <p>Electro Froth which along with Comprehensive Froth 1976-1981 form the world's first simultaneous Froth release includes several songs from the same period when electronic music was first emerging and I've chosen Fad Gadget to represent both concepts.<\/p> <p>My personal favourite moment is the 'switch on' sound about 3 seconds into Being Boiled - lush!<\/p> ",
        "Post-comment":"<p>Hope you enjoy it!<\/p>"
      },
      {
        "Catalogue":"DVDCD35",
        "DJ":"DJ Decka",
        "Date":"",
        "Pre-comment":"<p>This year 2011 represents the 35th anniversary of me starting Ryton Comprehensive School (hence Comprehensive Froth 1976-1981 DVD-CD35) so I thought I'd look back reminisce and compile a few tracks from that period. Although I probably didn't realise it at the time in musical terms it was an extremely important and influential time. This compilation tries to capture some of the rawness anger and excitement of the original and next generation Punk bands including a selection of New Wave SKA, Gothic Rock and Electro songs as well as a sprinkling of one-hit wonders thrown in for good measure.<\/p> <p>Obviously an awful lot of the songs from this period have already appeared on previous Froth releases and there are many commercial compilations covering this time. However I've tried to make this one a little different by searching for early songs and alternative versions and where possible unused classics to create a slightly different chronological mix. I hope you enjoy listening to this personal compilation as much as I have researching and compiling it!<\/p>",
        "Post-comment":"<p>Ahhh the memories!!<\/p>"
      },
      {
        "Catalogue":"DVDCD36",
        "DJ":"DJ Decka & DJ Dick",
        "Date":"November 2012",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD37",
        "DJ":"DJ Decka",
        "Date":"September 2013",
        "Pre-comment":"<p>Very simple theme this one – songs from American artists. I’ve followed the classic Froth template:<\/p><ul>\r\n<li>Mixing new and old artists.<\/li>\r\n<li>Very Frothy Intro<\/li>\r\n<li>A chilled Froth middle bit<\/li>\r\n<li>Finishing with a Frothy, fun and upbeat finale, on this occasion grouping three bands from historic New York CBGB American punk and New Wave scene in the late 1970s – Ramones, Talking Heads and Blondie<\/li>\r\n<\/ul><p>\r\nPersonal standout favourite tracks include Brother Dege from the Django Unchained soundtrack, The National’s Fake empire which is totally brilliant and of course Eels, who I’ve tried to include on all my compilations in recent years and will continue to do so ‘coz they’re propa mint! ☺<\/p>\r\n<p>\r\nThe artwork is obviously loud and colourful and it was particularly good fun finding out where each artist originated from (courtesy of Wikipedia) and plotting each on the inside front cover state map! Enjoy.\r\n<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD39",
        "DJ":"DJD",
        "Date":"March 2014",
        "Pre-comment":"<p>Taking inspiration from DJV's original RETRO FROTH (DVD-CD7) compilation, unbelievably released 12 years ago way back in 2002, it was always my intention to release my own version of this classic theme. I've been slowly compiling tracks since then until now, finally, RETRO FROTH 2 is ready!<\/p>\r\n<p>The songs span from 1965 to 1976 with the majority being from the early 1970s. They neatly split into four groups so I've nostalgically labelled them sides 1 to 4 as if part of a double LP vinyl release. Side 1 is Classic Rock, Side 2 is Soul and Funky, Side 3 is Acoustic and Strings and Side 4 is back to Classic Rock but with a little bit of fun thrown in there.<\/p>\r\n<p>Although some of these songs have been personal favourites for years (Life's A Gas and Rock And Roll), others have been discovered whilst watching films (Catch The Wind from The Invention Of Lying), listening to BBC 6 (The Rubberband Man) and covered live by Eels (Somebody's Watching You). It's also worth noting that despite already appearing on DJd's earlier Froth compilation (SOMETHING OLD, NEW, BORROWED & BLUE (DVD-CD10)), I've gone ahead and reused Bowie's Rock ‘n' Roll Suicide, quite simply because it's such a good song and nicely finishes ‘Side 1'!<\/p>\r\n<p>The artwork is based heavily on multi-coloured psychedelic images with the Marilyn Monroe front cover being a nod of respect to DJV's original artwork which also included an image of Marilyn. Hope you enjoy it!<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD38",
        "DJ":"DJ Dick",
        "Date":"14th December 2013",
        "Pre-comment":"<p>A result of blue sky thinking.<\/p><p>My turn at a Froth release was somewhat overdue and so in August of 2013 I turned my attention to putting together a new collection. For a number of years I had toyed with the idea of a \"Retro Froth 2\" so while on a business trip to Riga I began the process. Included in the initial list were War Pigs by Black Sabbath and Black Dog by Led Zeppelin, but while flying over the North Sea on my way back to the UK it suddenly struck me; was there a different theme here vying for my attention? The proliferation of dogs and horses struck a chord and I soon started typing into my iPad as many types of animals as I could think of.  By the time I landed I had a list of 50+ animals to find tracks for which were populated, filtered and whittled down to the collection you see here.<\/p><p>I hope you enjoy this idea that literally fell out of the sky.<\/p><p>As for a Retro Froth 2?  Watch this space!<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD42",
        "DJ":"DJ Decka & DJ Dick",
        "Date":"28th December 2016",
        "Pre-comment":"<p>A brother to Venus (<a href=\"http:\/\/www.frothmusic.co.uk\/frothmusic\/dvdcd.php?id=36\">DVDCD-36<\/a>).<\/p>",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD44",
        "DJ":"DJ Dick",
        "Date":"26 December 2017",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD43",
        "DJ":"DJ Decka",
        "Date":"23 December 2017",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"",
        "DJ":"",
        "Date":"",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD40",
        "DJ":"DJ Vinnie",
        "Date":"June 2015",
        "Pre-comment":"",
        "Post-comment":""
      },
      {
        "Catalogue":"DVDCD41",
        "DJ":"DJ Decka",
        "Date":"November 2015",
        "Pre-comment":"<p>A non-themed compilation following the classic Froth format - Frothy Introduction, Chilled Middle Bit, Frothy Finale!<\/p><p>I deliberately didn't print track & artist information on to the CD itself to keep the whole design as minimal as possible. However, your CD text-compatible players should still display this information as usual. I liked the contradiction of the title which forces the listener to play the CD to confirm the compilation is indeed Clearly Froth. Some may say it’s a cop out from doing artwork but others may say <em>genius<\/em>!<\/p><p>I prefer the latter &#9786;<\/p>",
        "Post-comment":""
      }
    ]
  }
]
